{
    "nicknames": [
        "Nova",
        "Suki",
        "Luna",
        "Kai",
        "Milo",
        "Echo",
        "Aria",
        "Zion",
        "Cleo",
        "Ezra",
        "Juno",
        "Bowie",
        "Nico",
        "Remi",
        "Sage",
        "Veda",
        "Wren",
        "Xena",
        "Yara",
        "Zane",
        "Atlas",
        "Bear",
        "Coco",
        "Dove",
        "Elio",
        "Faye",
        "Grey",
        "Halo",
        "Indie",
        "Jazz",
        "Koda",
        "Lux",
        "Mars",
        "Navy",
        "Onyx",
        "Pip",
        "Quinn",
        "Rue",
        "Sky",
        "True",
        "Uma",
        "Vale",
        "Wolf",
        "Xyle",
        "Yolo",
        "Zola",
        "Ace",
        "Blue",
        "Chip",
        "Dash",
        "Elm",
        "Fox",
        "Gem",
        "Hawk",
        "Ivy",
        "Jet",
        "Kit",
        "Lark",
        "Moon",
        "Nori",
        "Oak",
        "Paz",
        "Qe",
        "Rain",
        "Snow",
        "Teal",
        "Ursa",
        "Vow",
        "Wish",
        "Xo",
        "Yuri",
        "Zen",
        "Ash",
        "Bee",
        "Coy",
        "Dot",
        "Eve",
        "Fly",
        "Gus",
        "Hue",
        "Ink",
        "Joy",
        "Key",
        "Leo",
        "Max",
        "Neo",
        "Owl",
        "Pax",
        "Rio",
        "Sol"
    ],
    "messages": {
        "morning": {
            "poetic": [
                "The sun rose just to see your smile today.",
                "Morning light paints the world, but you color my life.",
                "Awake, my love. The universe has written a new page for us.",
                "Softly the day begins, like a whisper of hope.",
                "Dew on the grass, gratitude in my heart.",
                "The dawn breaks, and with it, my love for you renews.",
                "Let the morning breeze remind you of my gentle touch.",
                "Golden hour begins the moment you open your eyes.",
                "The sky dreamed of this morning, and so did I.",
                "Every sunrise is a poem written for us.",
                "Light filters in, but your soul shines brighter.",
                "Waking up is sweet because the reality is you.",
                "The day offers infinite possibilities, just like our love.",
                "Morning stillness, a canvas for our shared dreams.",
                "Let the warmth of the sun be my embrace today.",
                "A new day, a new chance to love you deeper.",
                "The world wakes up, but my world wakes with you.",
                "Sunlight dances, mirroring the joy you bring.",
                "Breathe in the morning; it tastes of potential.",
                "Like the tide to the shore, I return to you each morning."
            ],
            "playful": [
                "Good morning! I love you more than coffee (and that's a lot).",
                "Rise and shine, superstar!",
                "Warning: You look too good this morning.",
                "Top o' the morning to my favorite human.",
                "Let's attack this day like a squirrel on an energy drink.",
                "You, me, and a whole lot of seizing the day.",
                "Wakey wakey, eggs and bakey!",
                "Morning! Don't forget to be awesome.",
                "Sending you a virtual high-five for waking up.",
                "Ready to conquer the world? Or just breakfast?",
                "Good morning! Let's make today jealous of yesterday.",
                "Alert: Cuteness overload detected upon waking.",
                "Up and at 'em, tiger!",
                "Good morning! I dreamed of you (it was a good one).",
                "Let's be productive... after one more coffee.",
                "Morning! Try not to be too amazing today.",
                "Rise like a phoenix (or a very sleepy owl).",
                "Hello, sunshine! You're brighter than my phone screen.",
                "Good morning. I like your face.",
                "Let's get this bread (and by bread, I mean cuddles)."
            ],
            "minimal": [
                "Today is yours.",
                "Breathe. Begin.",
                "Morning, love.",
                "New day. New grace.",
                "You are ready.",
                "Shine bright.",
                "Start fresh.",
                "Be present.",
                "Go gently.",
                "Rise up.",
                "Love you.",
                "Have faith.",
                "Stay true.",
                "Keep going.",
                "You got this.",
                "Peace begins.",
                "Simply be.",
                "Hello, you.",
                "Make waves.",
                "Trust today."
            ]
        },
        "night": {
            "poetic": [
                "The stars are just holes in the floor of heaven, watching over you.",
                "Let the moonlight guide your dreams tonight.",
                "Sleep softly, for the night holds you in its arms.",
                "The day is done, but my love for you is endless.",
                "Drift away on a sea of calm and starlight.",
                "Night falls, a velvet curtain for our rest.",
                "May your dreams be as beautiful as your soul.",
                "The moon whispers secrets of peace to your heart.",
                "Rest your head; the world can wait until tomorrow.",
                "Under the same canopy of stars, we are together.",
                "Silence falls, bringing the gift of renewal.",
                "The night air breathes a lullaby for you.",
                "Shadows lengthen, wrapping us in quiet comfort.",
                "Let go of the day, and float into the night.",
                "The universe rests, and so should you.",
                "Darkness is just a canvas for the stars.",
                "Sleep is the bridge between today and our tomorrow.",
                "May quietude settle upon your spirit tonight.",
                "The moon is a reminder that light exists in darkness.",
                "Close your eyes and feel the peace of the cosmos."
            ],
            "playful": [
                "Goodnight! Don't let the bed bugs bite (seriously).",
                "Sleep tight, don't text and drive... wait, you're sleeping.",
                "Dream of me, or I'll be jealous.",
                "Time to recharge your batteries, robot.",
                "Goodnight! See you on the flip side (tomorrow).",
                "Off to dreamland! Ticket for one.",
                "Sleep is the best time machine to breakfast.",
                "Night night! Don't hog the blankets in your dreams.",
                "Rest up, we have chaos to cause tomorrow.",
                "Goodnight. Turning off my brain... now.",
                "Sleep mode: Activated.",
                "Dream big (but not scary big).",
                "Goodnight! Try to snore quietly.",
                "Bedtime! The pillow is calling.",
                "See you in the morning, hopefully not too early.",
                "Count sheep, not worries.",
                "Goodnight! I love you to the moon (and back before breakfast).",
                "Charging... 10%... need sleep.",
                "Hit the hay! (Not literally).",
                "Goodnight! You're my favorite pillow thought."
            ],
            "minimal": [
                "Rest well.",
                "Sleep deep.",
                "Goodnight.",
                "Peace out.",
                "Dream sweet.",
                "Let go.",
                "Be still.",
                "Quiet now.",
                "Stars above.",
                "Day is done.",
                "Love remains.",
                "Drift off.",
                "Calm heart.",
                "Silence falls.",
                "Rest easy.",
                "Moon rise.",
                "Safe sleep.",
                "Night love.",
                "Deep breath.",
                "Until dawn."
            ]
        }
    }
}